MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAML21E17B/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/*
 * \brief Configuration of the CORTEX-M0PLUS Processor and Core Peripherals
 */
#define __MPU_PRESENT                  0 /**< MPU present or not                                                        */
#define __NVIC_PRIO_BITS               2 /**< Number of Bits used for Priority Levels                                   */
#define __VTOR_PRESENT                 1 /**< Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig         0 /**< Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                     1
#define __ARCH_ARM_CORTEX_M            1
#define __DEVICE_IS_SAM                1

/*
 * \brief CMSIS includes
 */
// Note: Changed for MikroE implementation.
// #include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
// #include "system_saml21.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup SAML21E17B_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAML21E17B                        */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/aes.h"
#include "component/ccl.h"
#include "component/dac.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/gclk.h"
#include "component/mclk.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/opamp.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/trng.h"
#include "component/usb.h"
#include "component/wdt.h"
/** @}  end of Peripheral Software API */

/** \addtogroup SAML21E17B_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAML21E17B                                  */
/* ************************************************************************** */
#define ID_PM            (  0) /**< \brief Power Manager (PM) */
#define ID_MCLK          (  1) /**< \brief Main Clock (MCLK) */
#define ID_RSTC          (  2) /**< \brief Reset Controller (RSTC) */
#define ID_OSCCTRL       (  3) /**< \brief Oscillators Control (OSCCTRL) */
#define ID_OSC32KCTRL    (  4) /**< \brief 32k Oscillators Control (OSC32KCTRL) */
#define ID_SUPC          (  5) /**< \brief Supply Controller (SUPC) */
#define ID_GCLK          (  6) /**< \brief Generic Clock Generator (GCLK) */
#define ID_WDT           (  7) /**< \brief Watchdog Timer (WDT) */
#define ID_RTC           (  8) /**< \brief Real-Time Counter (RTC) */
#define ID_EIC           (  9) /**< \brief External Interrupt Controller (EIC) */
#define ID_PORT          ( 10) /**< \brief Port Module (PORT) */
#define ID_USB           ( 32) /**< \brief Universal Serial Bus (USB) */
#define ID_DSU           ( 33) /**< \brief Device Service Unit (DSU) */
#define ID_NVMCTRL       ( 34) /**< \brief Non-Volatile Memory Controller (NVMCTRL) */
#define ID_MTB           ( 35) /**< \brief Cortex-M0+ Micro-Trace Buffer (MTB) */
#define ID_SERCOM0       ( 64) /**< \brief Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       ( 65) /**< \brief Serial Communication Interface (SERCOM1) */
#define ID_SERCOM2       ( 66) /**< \brief Serial Communication Interface (SERCOM2) */
#define ID_SERCOM3       ( 67) /**< \brief Serial Communication Interface (SERCOM3) */
#define ID_SERCOM4       ( 68) /**< \brief Serial Communication Interface (SERCOM4) */
#define ID_TCC0          ( 69) /**< \brief Timer Counter Control (TCC0) */
#define ID_TCC1          ( 70) /**< \brief Timer Counter Control (TCC1) */
#define ID_TCC2          ( 71) /**< \brief Timer Counter Control (TCC2) */
#define ID_TC0           ( 72) /**< \brief Basic Timer Counter (TC0) */
#define ID_TC1           ( 73) /**< \brief Basic Timer Counter (TC1) */
#define ID_DAC           ( 76) /**< \brief Digital-to-Analog Converter (DAC) */
#define ID_AES           ( 77) /**< \brief Advanced Encryption Standard (AES) */
#define ID_TRNG          ( 78) /**< \brief True Random Generator (TRNG) */
#define ID_EVSYS         ( 96) /**< \brief Event System Interface (EVSYS) */
#define ID_SERCOM5       ( 97) /**< \brief Serial Communication Interface (SERCOM5) */
#define ID_TC4           ( 98) /**< \brief Basic Timer Counter (TC4) */
#define ID_ADC           ( 99) /**< \brief Analog Digital Converter (ADC) */
#define ID_AC            (100) /**< \brief Analog Comparators (AC) */
#define ID_PTC           (101) /**< \brief Peripheral Touch Controller (PTC) */
#define ID_OPAMP         (102) /**< \brief Operational Amplifier (OPAMP) */
#define ID_CCL           (103) /**< \brief Configurable Custom Logic (CCL) */
#define ID_PAC           (128) /**< \brief Peripheral Access Controller (PAC) */
#define ID_DMAC          (129) /**< \brief Direct Memory Access Controller (DMAC) */

#define ID_PERIPH_MAX    (129) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAML21E17B_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAML21E17B                    */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x43001000)                 /**< \brief AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x43000c00)                /**< \brief ADC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0x42003400)                /**< \brief AES Registers Address        */
#define CCL_REGS                         ((ccl_registers_t*)0x43001c00)                /**< \brief CCL Registers Address        */
#define DAC_REGS                         ((dac_registers_t*)0x42003000)                /**< \brief DAC Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x44000400)               /**< \brief DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /**< \brief DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002400)                /**< \brief EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x43000000)              /**< \brief EVSYS Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001800)               /**< \brief GCLK Registers Address       */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000400)               /**< \brief MCLK Registers Address       */
#define MTB_REGS                         ((mtb_registers_t*)0x41006000)                /**< \brief MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /**< \brief NVMCTRL Registers Address    */
#define OPAMP_REGS                       ((opamp_registers_t*)0x43001800)              /**< \brief OPAMP Registers Address      */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40000c00)            /**< \brief OSCCTRL Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001000)         /**< \brief OSC32KCTRL Registers Address */
#define PAC_REGS                         ((pac_registers_t*)0x44000000)                /**< \brief PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x40000000)                 /**< \brief PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x40002800)               /**< \brief PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /**< \brief PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x43001400)                /**< \brief PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000800)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002000)                /**< \brief RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000000)             /**< \brief SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000400)             /**< \brief SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000800)             /**< \brief SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42000c00)             /**< \brief SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x42001000)             /**< \brief SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x43000400)             /**< \brief SERCOM5 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001400)               /**< \brief SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x42002000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42002400)                 /**< \brief TC1 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x43000800)                 /**< \brief TC4 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42001400)                /**< \brief TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x42001800)                /**< \brief TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x42001c00)                /**< \brief TCC2 Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x42003800)               /**< \brief TRNG Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x41000000)                /**< \brief USB Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x40001c00)                /**< \brief WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

